In [53]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [9]:
!type C:\Users\zhou\Desktop\git\task\task\ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [10]:
df=pd.read_csv("ex1.csv")
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [11]:
pd.read_table("ex1.csv",sep=",")

C:\Users\zhou\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [12]:
!type ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [13]:
pd.read_csv("ex2.csv",header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [17]:
pd.read_csv('ex2.csv',names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [18]:
names=['a','b','c','d','message']
pd.read_csv('ex2.csv',names=names,index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [19]:
!type csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [21]:
parsed = pd.read_csv('csv_mindex.csv',index_col=['key1','key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [27]:
list(open('ex3.txt'))

['      A         B        C\n',
 'aaa -0.444 -10.344 -1251\n',
 'bbb -10.444 -16.344 -1251\n',
 'ccc -2.444 -11.344 -1231\n',
 'ddd -5.444 -10.34 -1451']

In [28]:
result = pd.read_table('ex3.txt',sep='\s+')
result

C:\Users\zhou\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

          A       B     C
aaa  -0.444 -10.344 -1251
bbb -10.444 -16.344 -1251
ccc  -2.444 -11.344 -1231
ddd  -5.444 -10.340 -1451

In [34]:
!type ex4.csv

#hey！,,,,
a,b,"c	",d,message
#just wanted to make things more difficult for you,,,,
#who reads csv files with computers anyway?,,,,
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [35]:
pd.read_csv('ex4.csv',skiprows=[0,2,3])

   a   b  c\t   d message
0  1   2    3   4   hello
1  5   6    7   8   world
2  9  10   11  12     foo

In [39]:
!type ex5.csv

something,a,b,c,d,message
one,1,2,3,4,
two,5,6,7,8,world
three,9,10,11,12,foo

In [47]:
result=pd.read_csv('ex5.csv')
result

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6   7   8   world
2     three  9  10  11  12     foo

In [48]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [50]:
sentinels={'message':['foo','NA'],'something':['two']}
pd.read_csv('ex5.csv',na_values=sentinels)

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       NaN  5   6   7   8   world
2     three  9  10  11  12     NaN

In [54]:
#ブロック単位でテキストファイルを読む
#pandasのフォーマット
#pd.options.display.max_row=10
#result=pd.read_csv('ex6.csv')
#result
#例がないから、略する
#pd.read_csv('ex6.csv',nrow=5)

In [55]:
#chunker=pd.read_csv('ex6.csv',chunksize=1000)  行を指定する 
#tot=pd.Series([])
#for piece in chunker:
    #tot=tot.add(piece['key'].value_counts(),fill_value=0)
#tot=tot.sort_values(ascending=false)

In [58]:
data=pd.read_csv('ex5.csv')
data

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6   7   8   world
2     three  9  10  11  12     foo

In [59]:
data.to_csv('out.csv')
!type out.csv

,something,a,b,c,d,message
0,one,1,2,3,4,
1,two,5,6,7,8,world
2,three,9,10,11,12,foo

In [60]:
import sys
data.to_csv(sys.stdout,sep='|')

|something|a|b|c|d|message
0|one|1|2|3|4|
1|two|5|6|7|8|world
2|three|9|10|11|12|foo

In [61]:
data.to_csv(sys.stdout,na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3,4,NULL
1,two,5,6,7,8,world
2,three,9,10,11,12,foo

In [62]:
data.to_csv(sys.stdout,index=False,header=False)

one,1,2,3,4,
two,5,6,7,8,world
three,9,10,11,12,foo

In [64]:
data.to_csv(sys.stdout,index=False,columns=['a','b','c'])

a,b,c
1,2,3
5,6,7
9,10,11

In [71]:
datas = pd.date_range('1/1/2000',periods=7)
ts=pd.Series(np.arange(7),index=datas)
ts.to_csv('tseries.csv')
!type tseries.csv

C:\Users\zhou\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  This is separate from the ipykernel package so we can avoid doing imports until

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [73]:
#分離フォーマットの処理
import csv
f=open('ex7.csv')
reader= csv.reader(f)
for line in reader :
    print (line)

['something', 'a', 'b', 'c', 'd', 'message']
['one', '“1"', '"2”', '“3”', '“4”', '']
['two', '5', '6', '“7”', '8', 'world']
['three', '9', '10', '11', '“12”', 'foo']

In [76]:
with open('ex7.csv')as f:
    lines=list(csv.reader(f))
header,values = lines[0],lines[1:]
data_dict={h:v for h,v in zip(header,zip(*values))}
data_dict

{'something': ('one', 'two', 'three'),
 'a': ('“1"', '5', '9'),
 'b': ('"2”', '6', '10'),
 'c': ('“3”', '“7”', '11'),
 'd': ('“4”', '8', '“12”'),
 'message': ('', 'world', 'foo')}

# JSONデータ

In [87]:
import json
obj="""
{"name":"wes",
     "places_lived":["United States","Spain","Germany"],
     "pet":null,
     "siblings":[{"name":"Scott","age":30,"pets":["Zeus","Zuko"]},
                {"name":"Katie","age":38,
                "pets":["Sixs","Stache","Cisco"]}]
}"""#
result=json.loads(obj)
result

{'name': 'wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixs', 'Stache', 'Cisco']}]}

In [88]:
asjson= json.dumps(result)
siblings=pd.DataFrame(result['siblings'],columns=['name','age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [89]:
#print(data.to_json()) データがJSONに変更される

In [92]:
#webからデータ収集
#lxml.objectifyを用いてXMLを分析する

# 二進数のデータ

In [93]:
frame=pd.read_csv('ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [95]:
frame.to_pickle('frame_pickle')
pd.read_pickle('frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [96]:
#HDF5 format
frame=pd.DataFrame({'a':np.random.randn(100)})
store=pd.HDFStore('mydata.h5')
store['obj1']=frame
store['obj1_col']=frame['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [97]:
store['obj1']

           a
0   0.415847
1   1.198434
2   1.591116
3  -1.380570
4  -0.600183
5   0.402678
6   0.267578
7  -0.678241
8  -1.020467
9   1.202479
10 -0.997156
11 -0.100694
12 -1.074947
13  0.299336
14 -0.079379
15 -1.098046
16 -0.320392
17  0.400034
18 -1.444955
19  0.153455
20 -0.018047
21  2.317232
22  0.120976
23  1.439723
24  0.224786
25 -1.156512
26 -0.075729
27  0.469556
28  0.591389
29  1.201167
..       ...
70 -1.418267
71 -0.733633
72  1.940655
73 -1.197922
74 -0.170446
75  0.255484
76 -0.407726
77 -1.662993
78 -0.840515
79 -0.475039
80 -0.674016
81  0.000335
82  0.567639
83 -1.103111
84  0.057513
85 -1.118784
86 -0.201071
87 -1.602665
88  0.338012
89 -0.425931
90  0.335832
91 -1.170856
92 -0.381084
93  0.503296
94 -0.082449
95  0.759001
96  0.858412
97 -0.154270
98 -1.117948
99 -0.399795

[100 rows x 1 columns]

In [98]:
store.put('obj2',frame,format='table')
store.select('obj2',where=['index>=10 and index<=15'])

           a
10 -0.997156
11 -0.100694
12 -1.074947
13  0.299336
14 -0.079379
15 -1.098046

In [99]:
store.close()

In [100]:
frame.to_hdf('mydata.h5','obj3',format='table')
pd.read_hdf('mydata.h5','obj3',where=['index<5'])

          a
0  0.415847
1  1.198434
2  1.591116
3 -1.380570
4 -0.600183

In [106]:
#Microsoft Excelのファイルを読む
#lsx=pd.ExcelFile('ex1.xlsx')
#pd.read_excel(xlsx,'sheet1')

In [107]:
#writer =pd.ExcelWriter('ex2.xlsx')
#frame.to_excel(writer,"sheet1")
#writer.save()

# WEBインタラクション

In [108]:
#http://docs.python-requests.org

#  データベースインタラクション

In [110]:
import sqlite3
query="""
Create table test
(a Varchar(20),b Varchar(20),
c Real,d Integer)
"""
con=sqlite3.connect('mydata.sqlite')
con.execute(query)

In [124]:
con.commit()
data=[('Atlanta','Georgia',1.25,7),
      ('Tallahassee',"Florida",2.7,3),
     ('Sacramento','California',74,21)]
stmt="Insert into test values(?,?,?,?)"
con.executemany(stmt,data)

In [125]:
cursor=con.execute('select*from test')
rows=cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 7),
 ('Tallahassee', 'Florida', 2.7, 3),
 ('Sacramento', 'California', 74.0, 21),
 ('Atlanta', 'Georgia', 1.25, 7),
 ('Tallahassee', 'Florida', 2.7, 3),
 ('Sacramento', 'California', 74.0, 21)]

In [126]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [127]:
pd.DataFrame(rows,columns=[x[0] for x in cursor.description])

             a           b      c   d
0      Atlanta     Georgia   1.25   7
1  Tallahassee     Florida   2.70   3
2   Sacramento  California  74.00  21
3      Atlanta     Georgia   1.25   7
4  Tallahassee     Florida   2.70   3
5   Sacramento  California  74.00  21

In [128]:
import sqlalchemy as sqla
db=sqla.create_engine('sqlite:///mydata.sqlite')
pd.read_sql('select * from test',db)

             a           b      c   d
0      Atlanta     Georgia   1.25   7
1  Tallahassee     Florida   2.70   3
2   Sacramento  California  74.00  21